/**
 * ⚠️ 자동 생성된 파일입니다. 직접 수정하지 마세요.
 */

import type { SVGProps } from 'react';

const IconReservation = (props: SVGProps<SVGSVGElement>) => (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    width={24}
    height={24}
    fill="none"
    {...props}
    viewBox="0 0 24 24"
  >
    <mask
      id="prefix__a"
      width={24}
      height={24}
      x={0}
      y={0}
      maskUnits="userSpaceOnUse"
      style={{
        maskType: 'alpha',
      }}
    >
      <path fill="currentColor" d="M0 0h24v24H0z" />
    </mask>
    <g mask="url(#prefix__a)">
      <path
        fill="currentColor"
        d="m10.95 15.816 3.677-3.677a.75.75 0 0 1 .537-.228.73.73 0 0 1 .547.228.74.74 0 0 1 .233.542.74.74 0 0 1-.233.542l-4.128 4.129a.87.87 0 0 1-.633.271.87.87 0 0 1-.633-.271L8.29 15.323a.75.75 0 0 1-.229-.537.73.73 0 0 1 .229-.547.74.74 0 0 1 .542-.233q.31 0 .542.232zM5.308 21.5q-.758 0-1.283-.525a1.75 1.75 0 0 1-.525-1.283V6.308q0-.758.525-1.283T5.308 4.5h1.384V3.154q0-.329.22-.55a.75.75 0 0 1 .55-.22q.328 0 .549.22.22.221.22.55V4.5h7.577V3.135q0-.32.215-.535a.73.73 0 0 1 .535-.215q.319 0 .534.215a.73.73 0 0 1 .216.535V4.5h1.384q.758 0 1.283.525t.525 1.283v13.384q0 .758-.525 1.283t-1.283.525zm0-1.5h13.384a.3.3 0 0 0 .212-.096.3.3 0 0 0 .096-.212v-9.384H5v9.384q0 .116.096.212a.3.3 0 0 0 .212.096M5 8.808h14v-2.5a.3.3 0 0 0-.096-.212.3.3 0 0 0-.212-.096H5.308a.3.3 0 0 0-.212.096.3.3 0 0 0-.096.212z"
      />
    </g>
  </svg>
);
export default IconReservation;
