/**
 * ⚠️ 자동 생성된 파일입니다. 직접 수정하지 마세요.
 */

import type { SVGProps } from 'react';

const IconChip따스한 = (props: SVGProps<SVGSVGElement>) => (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    width={74}
    height={64}
    fill="none"
    {...props}
    viewBox="0 0 74 64"
  >
    <path
      fill="#E7FF7E"
      d="M41.34 2.597 39.07 20.61 66.911 0l6.465 9.042L46.229 27.45l15.367 2.514-2.188 10.77L37.5 35.472l-1.878 28.432-11.566-1.25 3.316-22.332L6.516 55.808 0 46.713l20.852-13.415-13.153-1.822 2.325-11.275 18.663 4.347 1.62-23.03zM30.25 57.933l.316.035.256-3.882zM7.695 48.147l.043.06.888-.66zm6.48-21.185 3.054.423-2.998-.698zM62.912 9.646l2.85-1.932-.083-.117z"
    />
  </svg>
);
export default IconChip따스한;
