/**
 * ⚠️ 자동 생성된 파일입니다. 직접 수정하지 마세요.
 */

import type { SVGProps } from 'react';

const IconCheck = (props: SVGProps<SVGSVGElement>) => (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    width={13}
    height={10}
    fill="none"
    {...props}
    viewBox="0 0 13 10"
  >
    <path
      fill="currentColor"
      d="m4.671 7.543-3.019-3.27a.9.9 0 0 0-.679-.299.88.88 0 0 0-.69.3 1.06 1.06 0 0 0-.283.74q0 .437.282.743L3.85 9.619q.353.381.822.381.47 0 .822-.381l7.23-7.83q.27-.292.277-.735a1.04 1.04 0 0 0-.276-.748.9.9 0 0 0-.685-.306.9.9 0 0 0-.685.306z"
    />
    <path
      fill="currentColor"
      d="m1.652 4.273 3.02 3.27L11.353.306A.9.9 0 0 1 12.039 0q.402 0 .685.306.282.306.276.748-.008.442-.276.735l-7.23 7.83Q5.14 10 4.67 10q-.47 0-.822-.381L.282 5.757A1.06 1.06 0 0 1 0 5.015q0-.436.282-.742a.88.88 0 0 1 .691-.299.9.9 0 0 1 .68.3"
    />
  </svg>
);
export default IconCheck;
